<a href="https://colab.research.google.com/github/TammyJade/TJ/blob/main/Web_Scraping_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import requests    # importing beautiful soup
from bs4 import BeautifulSoup
import pandas as pd    # alias

In [ ]:
# Allocating all URL's to variable names 

brooklyn_mens_V = 'https://www.brooklyncollegeathletics.com/sports/mens-volleyball/roster/2019'
baruch_mens_V = 'https://athletics.baruch.cuny.edu/sports/mens-volleyball/roster'
york_mens_V = 'https://yorkathletics.com/sports/mens-volleyball/roster'

In [ ]:
brooklyn_womens_V= 'https://www.brooklyncollegeathletics.com/sports/womens-volleyball/roster/2019'
baruch_womens_V = 'https://athletics.baruch.cuny.edu/sports/womens-volleyball/roster'
york_womens_V = 'https://johnjayathletics.com/sports/womens-volleyball/roster'

In [ ]:
brooklyn_mens_S = 'https://www.brooklyncollegeathletics.com/sports/mens-swimming-and-diving/roster'
baruch_mens_S  = 'https://athletics.baruch.cuny.edu/sports/mens-swimming-and-diving/roster'
york_mens_S  = 'https://yorkathletics.com/sports/mens-swimming-and-diving/roster'

In [ ]:
brooklyn_womens_S  = 'https://www.brooklyncollegeathletics.com/sports/womens-swimming-and-diving/roster'
baruch_womens_S = 'https://athletics.baruch.cuny.edu/sports/womens-swimming-and-diving/roster'
york_womens_S = 'https://queensknights.com/sports/womens-swimming-and-diving/roster'

In [ ]:
womens_swim = [brooklyn_womens_S,baruch_womens_S,york_womens_S] # variable names of URL's put into a list

heightFeet = []   # 1st appending list
heightInches = [] # 2nd appending list

names1=[] # 1st appending list 
names=[]  # 2nd appending list

for team in womens_swim:
  page = requests.get(team)

  soup = BeautifulSoup(page.content, 'html.parser')  # Parse html content through beautifulsoup

  tables = soup.find_all('table', class_ = 'sidearm-table-grid-template-1-breakdown-large')

  for table in tables:
      heights = table.find_all(class_ = 'height') # Finding all specified class
      name =  table.find_all('a')

      for x in heights:  
        heightFeet.append(x.get_text())
      for i in range(0, len(heightFeet)): # itterating through for loop
        y = heightFeet[i].split('-') # splitting feet and inches
        feet = float(y[0])  # converting from string to float, indexing first element
        inches = y[1].replace('-','') # indexing second element, removing additonal characters
        inches = float(inches)  #converting from string
        heightInches.append( (feet* 12) + inches) #appending converted feet to inches list 

      for n in name:
        names1.append(n.get_text())
      for i in range(0, len(names1)):
        x = names1[i].replace('\n',' ')
        names.append(x)

womens_swim = df = pd.DataFrame()  # Creating a df: two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
df['womens_swim_names'] = names 
df['womens_swim_heightInches'] = heightInches
womens_swim.head()  # The first 5 rows of a df

      womens_swim_names  womens_swim_heightInches
0        Semona Bardman                      66.0
1  Angella  Christopher                      67.0
2           Anna Curran                      63.0
3    Rachel  Davidovich                      64.0
4   Shenaika Eliassaint                      71.0

In [ ]:
womens_swim.info() # This method prints information about a DataFrame including the index dtype and columns, non-null values and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 2 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   womens_swim_names         77 non-null     object
 1   womens_swim_heightInches  77 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.3+ KB

In [ ]:
# Names and the heights of the 5 tallest and 5 shortest womens_swim:

tallest=womens_swim.sort_values(['womens_swim_heightInches'],ascending= False)
tallest.head()  # The first 5 rows of a df

      womens_swim_names  womens_swim_heightInches
14  Shenaika Eliassaint                      71.0
4   Shenaika Eliassaint                      71.0
41  Shenaika Eliassaint                      71.0
50         Onika George                      70.0
23         Onika George                      70.0

In [ ]:
shortest= womens_swim.sort_values(['womens_swim_heightInches'],ascending= True)
shortest.head()  # The first 5 rows of a df

       womens_swim_names  womens_swim_heightInches
54            Amanda Lee                      60.0
27            Amanda Lee                      60.0
61         Alicia Soares                      61.0
42          Julie  Huang                      61.0
53  Mirtho-Myra Lamonier                      61.0

In [ ]:
mens_swim = [brooklyn_mens_S,baruch_mens_S,york_mens_S] # variable names of URL's put into a list

heightFeet = []   # 1st appending list
heightInches = [] # 2nd appending list

names1=[] # 1st appending list 
names=[]  # 2nd appending list

for team in mens_swim:
  page = requests.get(team)

  soup = BeautifulSoup(page.content, 'html.parser')  # Parse html content through beautifulsoup

  tables = soup.find_all('table', class_ = 'sidearm-table-grid-template-1-breakdown-large')

  for table in tables:
      heights = table.find_all(class_ = 'height') # Finding all specified class
      name =  table.find_all('a')

      for x in heights:  
        heightFeet.append(x.get_text())
      for i in range(0, len(heightFeet)): # itterating through for loop
        y = heightFeet[i].split('-') # splitting feet and inches
        feet = float(y[0])  # converting from string to float, indexing first element
        inches = y[1].replace('-','') # indexing second element, removing additonal characters
        inches = float(inches)  #converting from string
        heightInches.append( (feet* 12) + inches) #appending converted feet to inches list  

      for n in name:
        names1.append(n.get_text())
      for i in range(0, len(names1)):
        x = names1[i].replace('\n',' ')
        names.append(x)

mens_swim = df = pd.DataFrame()  # Creating a df: two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
df['mens_swim_names'] = names 
df['mens_swim_heightInches'] = heightInches
mens_swim.head()   # The first 5 rows of a df

   mens_swim_names  mens_swim_heightInches
0  Ronaldo Barrios                    74.0
1     Devin Boodha                    69.0
2     Nikita  Cary                    68.0
3         Alec Chi                    70.0
4      Peter Ebert                    74.0

In [ ]:
mens_swim.info() # This method prints information about a DataFrame including the index dtype and columns, non-null values and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   mens_swim_names         92 non-null     object
 1   mens_swim_heightInches  92 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.6+ KB

In [ ]:
# Names and the heights of the 5 tallest and 5 shortest mens_swim:

tallest= mens_swim.sort_values(['mens_swim_heightInches'],ascending= False)
tallest.head()  # The first 5 rows of a df

    mens_swim_names  mens_swim_heightInches
24   Gregory Becker                    77.0
63     Kasper Gacek                    77.0
28     Kasper Gacek                    77.0
59   Gregory Becker                    77.0
56  Mark  MacEachen                    76.0

In [ ]:
shortest= mens_swim.sort_values(['mens_swim_heightInches'],ascending= True)
shortest.head()  # The first 5 rows of a df

       mens_swim_names  mens_swim_heightInches
42          Ben Sionov                    65.0
77          Ben Sionov                    65.0
45       Joseph Vasile                    67.0
34  Fernando Marroquin                    67.0
85      Anthony Jordan                    67.0

In [ ]:
womens_volleyball = [brooklyn_womens_V,baruch_womens_V,york_womens_V]  # variable names of URL's put into a list

heightFeet = []   # 1st appending list
heightInches = [] # 2nd appending list

names1=[] # 1st appending list 
names=[]  # 2nd appending list

for team in womens_volleyball:
  page = requests.get(team)

  soup = BeautifulSoup(page.content, 'html.parser')  # Parse html content through beautifulsoup

  tables = soup.find_all('table', class_ = 'sidearm-table-grid-template-1-breakdown-large')

  for table in tables:
      heights = table.find_all(class_ = 'height') # Finding all specified class
      name =  table.find_all('a')

      for x in heights:  
        heightFeet.append(x.get_text())
      for i in range(0, len(heightFeet)): # itterating through for loop
        y = heightFeet[i].split('-') # splitting feet and inches
        feet = float(y[0])  # converting from string to float, indexing first element
        inches = y[1].replace('-','') # indexing second element, removing additonal characters
        inches = float(inches)  #converting from string
        heightInches.append( (feet* 12) + inches) #appending converted feet to inches list  

      for n in name:
        names1.append(n.get_text())
      for i in range(0, len(names1)):
        x = names1[i].replace('\n',' ')
        names.append(x)

womens_volleyball = df = pd.DataFrame() # Creating a df: two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
df['womens_volleyball_names'] = names 
df['womens_volleyball_heightInches'] = heightInches
womens_volleyball.head()  # The first 5 rows of a df

  womens_volleyball_names  womens_volleyball_heightInches
0          Inesa Shimcani                            65.0
1             Ashley Fung                            67.0
2              Rain Zhang                            66.0
3     Yana Shaposhnikova                             63.0
4              Ezri  Shor                            65.0

In [ ]:
womens_volleyball.info()  # This method prints information about a DataFrame including the index dtype and columns, non-null values and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 2 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   womens_volleyball_names         78 non-null     object
 1   womens_volleyball_heightInches  78 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.3+ KB

In [ ]:
# Names and the heights of the 5 tallest and 5 shortest womens_volleyball:

tallest= womens_volleyball.sort_values(['womens_volleyball_heightInches'],ascending= False)
tallest.head()  # The first 5 rows of a df

   womens_volleyball_names  womens_volleyball_heightInches
74           Autumn Reeves                            74.0
56         Claudia Daporta                            72.0
71       Mirialis Almanzar                            72.0
75          Sophia Wheelan                            72.0
29         Claudia Daporta                            72.0

In [ ]:
shortest =womens_volleyball.sort_values(['womens_volleyball_heightInches'],ascending= True)
shortest.head()  # The first 5 rows of a df

     womens_volleyball_names  womens_volleyball_heightInches
31               Young Gi Go                            60.0
58               Young Gi Go                            60.0
22  Savanna Koutsakis-Keener                            61.0
64                  Cady Xia                            61.0
9   Savanna Koutsakis-Keener                            61.0

In [ ]:
mens_volleyball = [brooklyn_mens_V,baruch_mens_V,york_mens_V]  # variable names of URL's put into a list

heightFeet = []   # 1st appending list
heightInches = [] # 2nd appending list

names1=[] # 1st appending list 
names=[]  # 2nd appending list

for team in mens_volleyball:
  page = requests.get(team)

  soup = BeautifulSoup(page.content, 'html.parser')  # Parse html content through beautifulsoup

  tables = soup.find_all('table', class_ = 'sidearm-table-grid-template-1-breakdown-large')

  for table in tables:
      heights = table.find_all(class_ = 'height') # Finding all specified class
      name =  table.find_all('a')

      for x in heights:  
        heightFeet.append(x.get_text())
      for i in range(0, len(heightFeet)): # itterating through for loop
        y = heightFeet[i].split('-') # splitting feet and inches
        feet = float(y[0])  # converting from string to float, indexing first element
        inches = y[1].replace('-','') # indexing second element, removing additonal characters
        inches = float(inches)  #converting from string
        heightInches.append( (feet* 12) + inches) #appending converted feet to inches list  

      for n in name:
        names1.append(n.get_text())
      for i in range(0, len(names1)):
        x = names1[i].replace('\n',' ')
        names.append(x)

mens_volleyball = df = pd.DataFrame()  # Creating a df: two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
df['mens_volleybal_names'] = names 
df['mens_volleybal_heightInches'] = heightInches
mens_volleyball.head()    # The first 5 rows of a df

  mens_volleybal_names  mens_volleybal_heightInches
0        Snigdho Hasan                         65.0
1    Michael  Valentin                         69.0
2        Andres Vargas                         72.0
3       Jasper Diangco                         70.0
4      Sayuj Zachariah                         74.0

In [ ]:
mens_volleyball.info() # This method prints information about a DataFrame including the index dtype and columns, non-null values and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 2 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   mens_volleybal_names         75 non-null     object
 1   mens_volleybal_heightInches  75 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1.3+ KB

In [ ]:
# Names and the heights of the 5 tallest and 5 shortest mens_volleyball:

tallest =mens_volleyball.sort_values(['mens_volleybal_heightInches'],ascending= False)
tallest.head()  # The first 5 rows of a df

   mens_volleybal_names  mens_volleybal_heightInches
65          Akil Vaughn                         77.0
53         Artem Zinkin                         77.0
27         Artem Zinkin                         77.0
30     Leon Petrovitsky                         77.0
56     Leon Petrovitsky                         77.0

In [ ]:
shortest =mens_volleyball.sort_values(['mens_volleybal_heightInches'],ascending= True) 
shortest.head()  # The first 5 rows of a df

   mens_volleybal_names  mens_volleybal_heightInches
67    Jayden Deokinanan                         64.0
0         Snigdho Hasan                         65.0
35        Snigdho Hasan                         65.0
9         Snigdho Hasan                         65.0
62       Juan Rodriguez                         66.0

In [ ]:
merged = pd.concat([ mens_swim, mens_volleyball, womens_swim, womens_volleyball], axis=1, ignore_index=False ) # merging all the df 
merged.head()  # The first 5 rows of a df

   mens_swim_names  ...  womens_volleyball_heightInches
0  Ronaldo Barrios  ...                            65.0
1     Devin Boodha  ...                            67.0
2     Nikita  Cary  ...                            66.0
3         Alec Chi  ...                            63.0
4      Peter Ebert  ...                            65.0

[5 rows x 8 columns]

In [ ]:
merged.describe() # summary stats: Containes averages of the heights of the different heights of mens and womens swim and volleyball

       mens_swim_heightInches  ...  womens_volleyball_heightInches
count               92.000000  ...                       78.000000
mean                70.891304  ...                       65.987179
std                  2.899248  ...                        3.304832
min                 65.000000  ...                       60.000000
25%                 69.000000  ...                       64.000000
50%                 70.000000  ...                       66.000000
75%                 73.000000  ...                       67.750000
max                 77.000000  ...                       74.000000

[8 rows x 4 columns]

In [ ]:
from google.colab import files     # exporting csv
merged.to_csv('sports_evaluation_project.csv') 
files.download('sports_evaluation_project.csv')